cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'gdubw/gng'

brew 'ack'                       # grep
brew 'asdf'                      # One Version Manager To Rule Them All
brew 'bash'
brew 'bat'                       # cat
brew 'coreutils'                 # https://apple.stackexchange.com/questions/69223/how-to-replace-mac-os-x-utilities-with-gnu-core-utilities
brew 'curl'
brew 'diffutils'
brew 'fd'                        # Simple, fast, and user-friendly alternative to find
brew 'fx'                        # Function eXecution - a tool for viewing JSON and YAML
brew 'findutils'                 # classic GNU find
brew 'fzf'                       # Useful fuzzy search tool (https://github.com/junegunn/fzf)
brew 'gawk'                      # GNU awk
brew 'gh'                        # The GitHub CLI
brew 'git'                       # Should be installed when homebrew is installed, but this just makes it official
brew 'git-delta'                 # Syntax-highlighting pager for git and diff output
brew 'git-filter-repo'           # Very useful for doing large history transformations
brew 'gng'                       # A nice utility to make it easier to invoke Gradle
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'go'
brew 'gpg'
brew 'gpg2'
brew 'graphviz'                  # Create graphs and diagrams using a text-based DSL
brew 'grep'                      # GNU grep
brew 'gzip'
brew 'hub'                       # CLI for GitHub
brew 'imagemagick'
brew 'jq'                        # json query
brew 'k9s'
brew 'libgit2'
brew 'mas'                       # Mac App Store command-line interface
brew 'moreutils'                 # Yet more useful utility commands
brew 'openssl'
brew 'pinentry-mac'              # Useful password entry -- needed to store gpg key passphrases in the Mac Keychain and such
brew 'poetry'                    # Python package management tool
brew 'readline'                  # enables command-line editing with vi/emacs keybindings
brew 'renameutils'               # provides icp and imv
brew 'shellcheck'
brew 'tree'                      # show directory structures on the commandline
brew 'watch'                     # watch command that lets you run a command periodically, showing output in fullscreen
brew 'wget'
brew 'yq'                        # like jq, for yaml
brew 'zsh-syntax-highlighting'
brew 'zsh'

cask 'clocker'
cask 'firefox'
cask 'font-jetbrains-mono-nerd-font'
cask 'hot'
cask 'insomnia'
cask 'iterm2'
cask 'spectacle'
cask 'visualvm'

